Repository: cesargalindo/i18n-angular-example
Catalog: src/locale/messages.*.xlf
Languages: fr

# introductionHeader
source: Hello Stranger!
fr: Bonjour étranger!

# root-c_container_test
source: I don't output any element
fr: Je ne produit aucun élément

# root-c_tab1_label
source: Plurals Clicks
fr: Clics pluriels

# root-c_tab2_label
source: Custom Pipes
fr: Tuyaux personnalisés

# root-c_tab4_label
source: Input Fields
fr: Champs de saisie

# root-c_tab5_label
source: Other
fr: Autre

# root-c_puralsTitle
source: Dynamic Plurals Text
fr: Texte pluriel dynamique

# root-c_pipesTitle
source: Custom Pipes Text
fr: Texte des tuyaux personnalisés

# root-c_dateTitle
source: Date Pipes Text
fr: Texte des tuyaux de date

# date-examples_H2Header
source: Date stuff
fr: Trucs de date

# footer-c_en-US
source: US English
fr: Anglais américain

# footer-c_fr
source: French
fr: Français

# footer-c_de
source: German
fr: Allemand

# footer-c_ja
source: Japan
fr: Japon

# input-field-c_label_fullName
source: Full Name
fr: Nom et prénom

# input-field-c_label_gender
source: Gender
fr: Le sexe

# input-field-c_matOptionGender
source: {VAR_SELECT, select, Male {Male} Female {Female} Other {Other}}
fr: {VAR_SELECT, select, Male {Homme} Female {Femelle} Other {Autre}}

# input-field-c_radioLabel
source: Pick your favorite season
fr: Choisissez votre saison préférée

source: {VAR_SELECT, select, Winter {Winter} Spring {Spring} Summer {Summer} Autumn {Autumn}}
fr: {VAR_SELECT, select, Winter {L'hiver} Spring {Printemps} Summer {Été} Autumn {Automne}}

# Other-RegComplete
source: Registration Complete
fr: Inscription complète

# Other-RegUpdated
source: Registration Updated
fr: Inscription mise à jour

# Other-RegDraftSaved
source: Registration Draft Saved
fr: Brouillon d'enregistrement enregistré

# Other-RegDraftUpdated
source: Registration Draft Updated
fr: Brouillon d'inscription mis à jour

# pipe-examples-c_pipeH2
source: Pipe stuff
fr: Trucs de pipe

# pipe-examples-c_pipeH3Red
source: Can NOT localize
fr: Impossible de localiser

# pipe-examples-c_pipeH3Green
source: Works, we can localize
fr: Fonctionne, nous pouvons localiser

source: {VAR_SELECT, select, CANCELED {Registration Status: CANCELED } CREATED {Registration status: CREATED } COMPLETE {Registration status: COMPLETE }}
fr: {VAR_SELECT, select, CANCELED {Statut d'inscription: ANNULÉ} CREATED {Statut d'inscription: CRÉÉ} COMPLETE {Statut d'inscription: COMPLETE}}

source: {VAR_SELECT, select, true {Continue Draft Registration} false {Add New Registration}}
fr: {VAR_SELECT, select, true {Continuer l'enregistrement du brouillon} false {Ajouter une nouvelle inscription}}

# pipe-examples-c_amendedMessageTitle
source: Amended Message Pipe
fr: Canal de message modifié

# pipe-examples-c_testAmendedPipe1
source: Amended {{ testAmended1 | amendedMessage}}
fr: Modifié{{ testAmended1 | amendedMessage}}

# identification_trans_unit
source: Text text this.prescriptionStatus1 another text
fr: Texte textethis.prescriptionStatus1 un autre texte

# angular-logo-id
source: Angular logo
fr: Logo angulaire

# plurals-click-c_pluralUpdatedText1
source: Updated {minutes, plural, =0 {just now} =1 {one minute ago} other {{{minutes}} minutes ago}}
fr: Actualisé{minutes, plural, =0 {just now} =1 {one minute ago} other {{{minutes}} minutes ago}}

source: {VAR_PLURAL, plural, =0 {just now} =1 {one minute ago} other {{INTERPOLATION} minutes ago}}
fr: {VAR_PLURAL, plural, =0 {juste maintenant} =1 {il y a une minute} other {{INTERPOLATION} il y a quelques minutes}}

# plurals-click-c_puralAuthorText
source: The author is {gender, select, male {male} female {female} other {other}}
fr: L'auteur est{gender, select, male {male} female {female} other {other}}

source: {VAR_SELECT, select, male {male} female {female} other {other}}
fr: {VAR_SELECT, select, male {Masculin} female {femelle} other {autre}}

# plurals-click-c_pluralUpdatedText12
source: Updated: {minutes, plural, =0 {just now} =1 {one minute ago} other {{{minutes}} minutes ago by {gender, select, male {male} female {female} other {other}}}}
fr: Actualisé:{minutes, plural, =0 {just now} =1 {one minute ago} other {{{minutes}} minutes ago by {gender, select, male {male} female {female} other {other}}}}

source: {VAR_PLURAL, plural, =0 {just now} =1 {one minute ago} other {{INTERPOLATION} minutes ago by {VAR_SELECT, select, male {male} female {female} other {other}}}}
fr: {VAR_PLURAL, plural, =0 {juste maintenant} =1 {il y a une minute} other {{INTERPOLATION} il y a quelques minutes par{VAR_SELECT, select, male {Masculin} female {femelle} other {autre}}}}

# loginButton
source: Login
fr: Connexion

# submitButton
source: Submit
fr: Nous faire parvenir

# toggleStatusButton
source: Toggle Status
fr: Basculer le statut

# changeMessageButton
source: Change Message
fr: Changer de message

# continueDraftRegistrationButton
source: Continue Draft Registration
fr: Continuer l'enregistrement du brouillon

# addNewRegistrationButton
source: Add New Registration
fr: Ajouter une nouvelle inscription

# AmendedMessagePipe-Interpretation
source: - Interpretation
fr: - Interprétation

# AmendedMessagePipe-Demographics
source: - Demographics
fr: - Démographie

# PrescripionStatusPipe-Canceled
source: Canceled
fr: Annulé

# PrescripionStatusPipe-Processing
source: Processing
fr: Traitement

# PrescripionStatusPipe-Complete
source: Complete
fr: Compléter

# PrescripionStatusPipe-Created
source: Created
fr: Établi

# title-s_messageY0
source: default message Y on load
fr: message par défaut Y au chargement

# title-s_messageY1
source: Testing Message Y from Plurals
fr: Test du message Y des pluriels

# title-s_messageY2
source: Testing Message Y from Pipes
fr: Test du message Y des tuyaux

# form-field-error-c_required
source: Required
fr: Obligatoire

# form-field-error-c_minValue
source: Min value is {{ formElement.errors?.min?.min }}
fr: La valeur minimale est{{ formElement.errors?.min?.min }}

# form-field-error-c_minLength
source: At least {{ formElement.errors?.minlength.requiredLength }} are required.
fr: Au moins{{ formElement.errors?.minlength.requiredLength }} sont requises.
